// array of object for human-developement books

var humanDevelopement = [{id:1,
                          name:"مميز بالأصفر",
                          img:"img/A-2.jpg",
                          description:'يمتعنا "إتش. جاكسون براون" فى كتابه مميز بالأصفر" بمجموعة من القصص والاقتباسات التى تدل على فهم عميق لأسس الحياة الطيبة، فهذا الكتاب يعد مقرراً تعليمياً مختصراً فى كيفية العيش بحكمة والاختيار بذكاء، يسلط فيه الكاتب الضوء على أهمية التصرف بلطف وكرم وإحسان مع الآخرين، وتوطيد علاقات قوية راسخة مع الأشخاص الذين نحبهم، واختيار توجهات ذهنية تساعدنا أثناء عيش ساعات الحياة اليومية العادية، واكتشاف معنى الرضا والإشباع النابعين من تقدير المتع البسيطة والاستمتاع بها.',
                          url:"https://archive.org/details/www.nasadrar.com/mode/2up"
                            },
                            {id:2,
                              name:"عشرة أمور تمنيت لو عرفتها قبل دخولي الجامعة",
                            img:"img/A-3.jpg",
                            description:'يتطرق الدكتور "ياسر عبد الكريم بكار" في هذا الكتاب إلى كافه جوانب الحياة الجامعية لدى كل من الشاب والفتاة علميا ، أكاديميا، روحانيا، اجتماعيا، وحتى على الجانب العاطفي؛ فيبين بذلك كل جوانب الصعاب والمشاكل الحياتية الجامعية التي من شأن كل طالب مقبل على الجامعه الولوج فيها..',
                            url:"https://archive.org/details/shimaaali7557ss_yahoo"},
                            {id:3,
                              name:"نظرية الفستق",
                            img:"img/A-7.jpg",
                            description:'كتاب سيغير طريقة تفكيرك وحكمك على الأشياء. يحتوي على مجموعة مقالات تتمحور غالبا عن تطوير الذات والبرمجة اللغوية العصبية وطرق التفكير والوعي والسلوك الإنساني. الكتاب يتضمن 65 موضوعا. كل منها تختوي على 5 صفحات وهو خاص بطرق التفكير والسلوك والحكم على الأشياء. كتاب تنمية ذاتيه بحت.',
                            url:"https://foulabook.com/ar/book/%D9%86%D8%B8%D8%B1%D9%8A%D8%A9-%D8%A7%D9%84%D9%81%D8%B3%D8%AA%D9%82-pdf"
                              },{
                                id:5,
                                name:"ابق قويا 365 يوم يالسنة",
                                img:"img/A-1.jpg",
                                description:"لقد لخصت ديمي لوفاتو الدروس التي تعلمتها خلال رحلتها في الحياة في هذا الكتاب وهي مجموعة مكونة من 365 يوما من أكثر أفكارها صراحة وشجاعة وتفاؤلا انها كلماتها الخاصة بالاضافة لمقتبسات ألهمتها وأيضا تأملات وأهداف خاصة بها هذا الكتاب يخاطب كل شخص في كل مكان في رحلته الخاصة لكل من يحتاج للراحة والالهام والدافع ليبقى قويا كل يوم",
                                url:"https://archive.org/details/20191015_20191015_0502"
                              },{id:6,
                                name:"امرأة من طراز خاص",
                                img:"img/A-4.jpg",
                                description:"كتاب يخاطب المرأة الطموحة، عبر استعراضه لعادات خمس يرى بأهمية أن تلتفت إليهم كل من تطمح في ارتياد القمة . يبدأ بعادة المبادرة، مشددا على أن المرأة الناجحة لا بد وأن تتمتع بصفة الإقدام، تصنع حياتها، وتمهد دربها، دون أن تنتظر ما قد يمن به عليها شخصا ما . ثم يتحدث عن الثقة بالنفس، فالنجاح لا يقترب من شخص مزعزع الفكر، مهترئ الوجدان، الثقة بالنفس هي التي تدفع المرء منا إلى العمل والتميز والنجاح . والعادة الثالثة هي الذكاء الاجتماعي، عن المرأة ذات القلب الساحر، الذي يستحوذ على نواصي القلوب والعقول يحدثنا . العادة الرابعة هيي التخطيط للحياة، كيف تسيطر المرأة على حياتها، وتضع البرامج والخطط لتحقيق أفضل النتائج، سؤال يجيبك عنه الكتاب . والعادة الخامسة والأخيرة هي إدارة الأولويات، عن الوقت وأهميته وطرق الاستفادة منه",
                                url:"https://archive.org/details/734specialwomentraz"
                              },{
                                id:7,
                                name:"العادات السبع للناس الأكثر فاعلية",
                                img:"img/A-5.jpg",
                                description:"الكتاب الاكثر مبيعا في أمريكا والعالم بيعت منه اكثر من 15 مليون نسخة كتاب يسبر أغوار الشخصية الانسانية ليخرج لنا بالعادات التي تنظم له سلوكه وتؤثر على حياته بفعالية كبيرة بشكل ايجابي .. هل تريد أن تكون ناجحا ؟؟ هل تريد قراءة كتاب يغير حياتك بشكل ايجابي؟؟ عليك بهذا الكتاب ..",
                                url:"https://archive.org/details/contact_ikra_20190313_1311"
                              },{id:8,
                                name:"العادات السبع للناس الأكثر فاعلية",
                                img:"img/A-5.jpg",
                                description:"تتشابه الأمومة والأبوة مع أي جانب آخر من جوانب الحياة ، حيث أننا نستطيع أن نتقدم وننجح إذا حاولنا تحليل الخطأ الذي وقعنا فيه ، وأسباب وقوعه وعملنا على إصلاحه . فمثلاً إن كان هناك طفلة ترفض القيام بواجباتها المنزلية ، وتستمر في الرفض على الرغم من عدد المرات التي يطلب منها والداها فعله وإلحاحهما بقولهما ‘ افعليه ، افعليه ، افعليه ‘ . عليهم إيجاد أسلوب آخر في المعاملة ",
                                url:"https://www.noor-book.com/%D9%83%D8%AA%D8%A7%D8%A8-%D9%83%D9%8A%D9%81-%D8%AA%D9%83%D9%88%D9%86%D8%A7%D9%86-%D8%A3%D9%85%D9%91%D8%A7%D9%8B%C2%A0%D9%88%D8%A3%D8%A8%D8%A7%D9%8B-%D8%A3%D9%81%D8%B6%D9%84-pdf"
                              }

                        ] ;

// array of object of religious books                        
                        
var religious=[{
                        name:"اول مرة اصلي",
                        img:"img/r-1.jpg",
                        description:'وقع حريق في بيت علي بن الحسين وهو ساجد ، فجعلوا يقولون : النار .. النار .. فما رفع رأسه حتى أُطفئت ، فقيل له في ذلك فقال : " ألهتني عنها النار الـأخرى "---وارفع السبابة وانت تتشهد ، واستشعر بذلك انك تخنق شيطانك وعصر أضلاعه وقهره بسبابة التوحيد ، فقد كان عبد الله بن عمر رضي الله عنه إذا جلس في الصلاة وضع يديه على ركبتيه وأشار بأصبعه وأتبعها بصره ، ثم قال : قال رسول الله صلَ الله عليه وسلم : " لهي أشد على الشيطان من الحديد " - يعني السبابة - ---حكى عن عطاء الخرساني : " ما من عبد يسجد لله سجدة في بقعة من بقاع الأرض إلا شهدت له يوم القيامة وبكت عليه يوم يموت "',
                        url:"https://archive.org/details/pdf05_20200412"
                      },{
                        name:"حوار مع صديقي الملحد",
                        img:"img/r-2.jpg",
                        description:'على الرغم من ان ابليس قال :( فبعزتك لأغوينهم أجمعين) عزة الله استغنت ومن شاء فليؤمن ومن شاء فليكفر ، ولن يضروا الله بشيء . قال تعالي : ( ولأقعدن لهم على صراطك المستقيم ولاتينهم من بين ايدهم ومن خلفهم وعن ايمانهم وعن شمائلهم ) ابليس لم يقل من فوقهم ومن تحتهم لان الفوق ربوبية لله وحده ، وتحت تواضع العبودية ومن لزم مكانه الأدنى من ربه الأعلى لم يستطع الشيطان أن يدخل عليه مجموعة من المقالات يجمع فيها المؤلف معظم الأطروحات التي يتبناها الفكر الإلحادي، ثم يقوم بمناقشتها والرد عليها، وذلك في صورة حوار بين صديقين.',
                        url:"https://archive.org/details/alfirdwsiy2018_gmail_2334"
                      },{
                        name :"لانك الله",
                        img:"img/r-3.jpg",
                        description:'حلة الى التعمق في معنى تسع من أسماء الله الصمد ، الحفيظ ، اللطيف ، الشافي ، الوكيل ،الشكور ، الجبار ، الهادي ، الغفور ، القريب، سيقربك الكتاب من ربك اكثر ويعرفك الى من انت بدونه ولا شئ ، نعمه تترى علينا واحدة تلو الأخرى وفي كل لحظه ونحن ما زلنا غافلين !',
                        url:'https://archive.org/details/1039Pdf_201808'
                      },{
                        name:"التأمل كيف تصل الى اليقين",
                        img:"img/r-6.jpg",
                        description:'هذا الكتاب يلقي الضوء ويلفت النظر إلى عبادة تخفت هذه الأيام رغم عظمتها، وتأكلها دوامة الحياة المتسارعة، وتضيع بين الزحام والعمل والمواصلات .. ثم البيت واحتياجات الزوجة (أو الزوج) وطلبات الأولاد. رغم انها المدخل الطبيعي للإيمان بالله تبارك وتعالى .. ورغم أنها أول طريق لليقين في الله تبارك وتعالي.. ورغم سهولتها ويسرها .. ورغم لذتها وروعتها .. ورغم احتياجنا إليها.. هذه العبادة، هي عبادة التأمل أو التفكر .. وكل من امتلك نفسا تريد الحق ومارس هذه العبادة .. كلهم .. كلهم .. بلا استثناء، بدأوا في طريق الإيمان بالله تبارك وتعالى',
                        url:"https://www.books4arab.com/%D8%AA%D8%AD%D9%85%D9%8A%D9%84-%D9%83%D8%AA%D8%A7%D8%A8-%D8%A7%D9%84%D8%AA%D8%A3%D9%85%D9%84-%D9%83%D9%8A%D9%81-%D8%AA%D8%B5%D9%84-%D8%A5%D9%84%D9%89-%D8%A7%D9%84%D9%8A%D9%82%D9%8A%D9%86-pdf-%D9%84/"
                      },{
                        name:"سنة التفاضل",
                        img:"img/r-9.jpg",
                        description:'الهدف من الكتاب إبراز وتوضيح وتبيين ما خص الله به الإناث من الفضل والمزايا في الدنيا ثم ما خصهم به من الأجر والثواب في الآخرة',
                        url:'https://basaer-online.com/download/%D8%B3%D9%86%D8%A9-%D8%A7%D9%84%D8%AA%D9%81%D8%A7%D8%B6%D9%84-%D9%88%D9%85%D8%A7-%D9%81%D8%B6%D9%84-%D8%A7%D9%84%D9%84%D9%87-%D8%A8%D9%87-%D8%A7%D9%84%D9%86%D8%B3%D8%A7%D8%A1-%D8%B9%D9%84%D9%89-%D8%A7/'
                      },{
                        name:"صفقات رابحة",
                        img:"img/r-10.jpg",
                        description:'قد أنعم الله علي بمنحة في صورة محنة, خلوت فيها إلى نفسي لأخط هذه الصفحات, والتي أسميتها (صفقات رابحة), وهي عبارة عن فصول في مدرسة الترغيب والترهيب, تلك المدرسة التي تعد من أنجح المدارس في تقويم النفس ودرء عيوبها وحثها على بذل الطاقة واستفراغ الوسع في طلب الجنة وحرث الآخرة, ولولا هذه المدرسة لكانت القلوب رقعة خربة في غياب ري الإيمان وبواعث الهدى.',
                        url:'https://www.noor-book.com/%D9%83%D8%AA%D8%A7%D8%A8-%D8%B5%D9%81%D9%82%D8%A7%D8%AA-%D8%B1%D8%A7%D8%A8%D8%AD%D8%A9-pdf'
                      },{
                        name:"الرحيق المختوم",
                        img:"img/r-13.jpg",
                        description:'ولا تزال وستبقى سيرة هذا النبي الكريم - صلى الله عليه وسلم - ملهمة لأولي الأقلام اللامعة والدراسات العميقة، للاستهداء بهديها والتأسي بصاحبها صلى الله عليه وسلم وممن أسهم في هذا المضمار ونهل من هذا المعين الصافي الشيخ صفي الرحمن المباركفوري - رحمه الله - في هذا؛ حيث كتب عن السيرة فصولاً مضيئة، وموازنات فريدة، وربط الأحداث ببعضها ربطاً متماسكاً بأسلوب بديع أخاذ، حيث استخلص من كتب الأقدمين فوائد بلورها في إيجاز غير مخل، وتطويل غير ممل، فجاء كافياً وافيا . كتابنا ً.',
                        url:'https://www.noor-book.com/%D9%83%D8%AA%D8%A7%D8%A8-%D8%A7%D9%84%D8%B1%D8%AD%D9%8A%D9%82-%D8%A7%D9%84%D9%85%D8%AE%D8%AA%D9%88%D9%85-pdf'
                      },{
                        name:"الاقتراب من الله",
                        img:"img/r-15.jpg",
                        description:'هناك مجموعة من الأسئلة اللاهثة حاول المؤلف أن يجيب عنها خلال مراحل حياته الأولى؛ كيف أن كل شىء ينتهى إلى الله؟ وكيف أنَّ أى تفسير يحتاج إلى تفسير، وهكذا إلى ما لا نهاية، باعتبار حضور قوة العلم الذى يقدم تفسيرًا لأكثر ما كان غامضًا، وحين انتقل إلى دور العالم الباحث بعد تخرجه، وجد نفسه رغمًا عنه قد بدأ يعبأ المساحة التى ظلت عبر قرون عديدة منطقة خاصة بالدين، وأصبح يستجوب ظواهر العالم.',
                        url:'https://www.noor-book.com/%D9%83%D8%AA%D8%A7%D8%A8-%D8%A7%D9%84%D8%A7%D9%82%D8%AA%D8%B1%D8%A7%D8%A8-%D9%85%D9%86-%D8%A7%D9%84%D9%84%D9%87-%D8%A8%D8%AD%D8%AB-%D9%81%D9%8A-%D8%A7%D8%B5%D9%84-%D8%A7%D9%84%D9%83%D9%88%D9%86-%D9%88%D9%83%D9%8A%D9%81-%D8%A8%D8%AF%D8%A7-%D8%A8%D9%88%D9%84-%D8%AF%D9%8A%D9%81%D9%8A%D8%B2-pdf'
                      },{
                        name:"بأي قلب نلقاه",
                        img:"img/r-17.jpg",
                        description:'حضارة اليوم وهي تسدد سهام خداعها صوب القلوب الغافلة لتصيب لُبها ، تحتاج إلى درع حصينة تتكسر عليه ، فأعينوني بقوة أجعل بينكم وبينهم ردما ، وما هذه الدرع سوى تربية إيمانية راسخة تورث النظر في العاقبة واليقين بالآخرة ، والتنافس في الخيرات والزهد في الفانيات ولا يتم ذاك إلا إذا رد الله إليك روحك ، وما أشبه هذه الحضارة ببساط يسحب الناس ببطء تجاه نهايتهم المحتومة ، وهم عنها غافلون وبغيرها مشتغلون ، والشيطان يرقص بينهم فرحاً ، ويقهقه وهو يشدهم بعيداً عن طريق النجاة ، حتى إذا ما وقعت بهم الداهية أفاقوا لكن هناك على أعتاب الحساب وفي ظلمةة القبر ؛ فيا إخوان أترضون أن يكون هذا حالكم تغفلون تغفلون ثم تموتون قتندمون !',
                        url:'https://foulabook.com/ar/book/%D8%A8%D8%A3%D9%8A-%D9%82%D9%84%D8%A8-%D9%86%D9%84%D9%82%D8%A7%D9%87-pdf'
                      }
                    ]
// array of object of historical books 
var historical=[{
                  name:"سيرة أمير المؤمنين عمر بن الخطاب",
                  img:"img/h-2.jpg",
                  description:'يقدم الصلابى شخصية امير المؤمنين عمر بن الخطاب بصورة مميزة كما لم يتحدث عنها كاتب من قبل، يتناول الصلابى فى هذا الكتاب عصر أمير المؤمنين ومراحل حياته و أهم الأحداث فى حياته منذ ولادته وحتى توليه زمام أمور الدولة الإسلامية وتوليه شأن المسلمين.',
                  url:"https://www.noor-book.com/%D9%83%D8%AA%D8%A7%D8%A8-%D8%B3%D9%8A%D8%B1%D8%A9-%D8%A3%D9%85%D9%8A%D8%B1-%D8%A7%D9%84%D9%85%D8%A4%D9%85%D9%86%D9%8A%D9%86-%D8%B9%D9%85%D8%B1-%D8%A8%D9%86-%D8%A7%D9%84%D8%AE%D8%B7%D8%A7%D8%A8-pdf"
                },
                {
                  name:"مائة من عظماء أمة الاسلام",
                  img:"img/h-3.jpg",
                  description:'ماهى بنود نظرية الغزو التاريخي؟و من هم غزاة التاريخ؟ماهى حكاية الاخوان بربروسا؟و من هو المحارب الثالث عشر؟ كيف نشأ المذهب الشيعى؟و ما هى الخصائص السبعة للشيعة في اى موضع بالضبط يوجد اسم"أحمد"فى الانجيل؟ما حكاية الرجل الغامض آريوس؟ ومن هم الاريوسيين الذين ذكرهم رسول الله-صلى الله عليه وسلم-في رسالته لهرقل؟ ماذا كتب هارون الرشيد على ظهر رسالة نقفور؟وماذا كتب المعتمد ابن عباد على ظهر رسالة ألفونسو',
                  url:"foulabook.com/ar/book/مائة-من-عظماء-أمة-الإسلام-غيروا-مجرى-التاريخ-pdf"},
                {
                  name:"قصة الاندلس",
                  img:"img/h-4.jpg",
                  description:' فقد بدأ موسى بن نصير فتح الشمال الإفريقي وقد تجاوزالستين من عمره ؛ أي تجاوز سنَّ المعاش في زمننا هذا ، ثم ها هو ذا في سنِّ الخامسة والسبعين يحزن حزنا ً شديداً ، ولكن على أي شيئٍ كان حزنه ؟! حزن أولا على أمر الوليد بن عبد الملك له بترك ساحة الجهاد ، وقد كان محباًّ له ؛ علَّه ينال الشهاده التى لم تُصِبْهُ ',
                  url:"https://www.noor-book.com/%D9%83%D8%AA%D8%A7%D8%A8-%D9%82%D8%B5%D8%A9-%D8%A7%D9%84%D8%A3%D9%86%D8%AF%D9%84%D8%B3-%D9%85%D9%86-%D8%A7%D9%84%D9%81%D8%AA%D8%AD-%D8%A5%D9%84%D9%89-%D8%A7%D9%84%D8%B3%D9%82%D9%88%D8%B7-pdf"
                },
                
                  {
                  name:"استرداد عمر",
                  img:"img/h-6.jpg",
                  description: ' نظر الكاتب إلي وجود العديد من الدمار والخراب في الدول العربية والإسلامية وجميع الشعوب غير قادرة على العيش عيشة كريمة, لذلك قام بفكرة كتابه حتى يستطيع استرداد سيدنا عمر من الكتب الموجودة بداخل المكتبات إلي الواقع الذي نعيش فيه ولكن بأسلوب مختلف حتى يستطيع القراء والمثقفين فهمه, وبالتالي من الممكن أن نفهم الفكر العمري ونقوم بتطبيقه لقيام الدول مرة أخرى ونهوضها من جديد, وهذا ما فكر به الكاتب حين قام بتأليف هذا الكتا',
                  url:"https://www.alarabimag.com/books/23003-%D8%A7%D8%B3%D8%AA%D8%B1%D8%AF%D8%A7%D8%AF-%D8%B9%D9%85%D8%B1-%D9%85%D9%86-%D8%A7%D9%84%D8%B3%D9%8A%D8%B1%D8%A9-%D8%A5%D9%84%D9%8A.html"},
                {
                  name:"فلسطين التاريخ المصور",
                  img:"img/h-7.jpg",
                  description:'إن فضل البقعة التي وجد فيها بيت المقدس ثابت تاريخياً، وفي نصوص القرآن والسنة الكثيرة. ولا شك أن هذا الفضل يعود لأحقاب ضاربة في القدم، ففي هذه البقعة نشأ ومات كثير من الأنبياء والرسل، وكانت مهبطاً لكثير من الرسالات والوحي، وبها جرت أعظم أحداث التاريخ القديم. وعلى الرغم من ذلك؛ فإن جهلاً عظيماً يحيط بالناس فيما يتعلق بتاريخ القدس والأقصى وأرض فلسطين المباركة. هذا وإن القضية المثارة حول الأقصى هي بحق من أهم قضايا المسلمين الحالية، من هذا المنطلق يأتي هذا العمل "فلسطين.. التاريخ المصور" الذي هو خدمة لتلك القضية',
                  url:"https://foulabook.com/ar/book/%D9%81%D9%84%D8%B3%D8%B7%D9%8A%D9%86..-%D8%A7%D9%84%D8%AA%D8%A7%D8%B1%D9%8A%D8%AE-%D8%A7%D9%84%D9%85%D8%B5%D9%88%D8%B1-pdf"},
                {
                  name:"هكذا ظهر جيل صلاح الدين و هكذا عادت القدس",
                  img:"img/h-8.jpg",
                  description:'يقول في المقدمة: إن هذا الكتاب دعوة إلى اعادة قراءة تاريخنا واستلهام نماذجه الناجحة، ودعوة إلى فقه سنن التغيير وكيف ان ظاهرة صلاح الدين ليست ظاهرة بطولة فردية خارقة ولكنها خاتمة ونهاية ونتيجه مقدرة لعوامل التجديد ولجهود الامة المجتهدة، وهي ثمرة مائة عام من محاولات التجديد والإصلاح. وبذلك فهي نموذج قابل للتكرار في كل العصور.',
                  url:"https://www.noor-book.com/%D9%83%D8%AA%D8%A7%D8%A8-%D9%87%D9%83%D8%B0%D8%A7-%D8%B8%D9%87%D8%B1-%D8%AC%D9%8A%D9%84-%D8%B5%D9%84%D8%A7%D8%AD-%D8%A7%D9%84%D8%AF%D9%8A%D9%86-%D9%88%D9%87%D9%83%D8%B0%D8%A7-%D8%B9%D8%A7%D8%AF%D8%AA-%D8%A7%D9%84%D9%82%D8%AF%D8%B3-%D8%A7%D9%84%D8%AF%D9%83%D8%AA%D9%88%D8%B1-%D9%85%D8%A7%D8%AC%D8%AF-%D8%B9%D8%B1%D8%B3%D8%A7%D9%86-%D8%A7%D9%84%D9%83%D9%8A%D9%84%D8%A7%D9%86%D9%8A-pdf"
                },
                { 
                  name:"علي بن ابي طالب",
                  img:"img/h-9.jpg",
                  description:'سيرة الامام علي بن ابي طالب',
                  url:"https://www.haydarya.com/maktaba_moktasah/05/book_50/sirah.pdf"
                },
                {
                  name:"عمر المختار",
                  img:"img/h-12.jpg",
                  description:'كان عمر المختار متوسط القامة يميل إلى الطول قليلاً، ولم يكن بالبدين الممتلئ أو النحيف الفارغ، أجش الصوت بدوي اللهجة، رصين المنطق، صريح العبارة، لايمل حديثه، متزن في كلامه، تفتر ثناياه أثناء الحديث عن ابتسامة بريئة، أو ضحكة هادئة إذا ما اقتضاها الموقف، كثيف اللحية وقد أرسلها منذ صغره، تبدو عليه صفات الوقار والجدية في العمل، والتعقل في الكلام والثبات عند المبدأ وقد أخذت هذه الصفات تتقدم معه بتقدم السن',
                  url:"https://foulabook.com/ar/book/%D8%A7%D9%84%D8%B4%D9%8A%D8%AE-%D8%A7%D9%84%D8%AC%D9%84%D9%8A%D9%84-%D8%B9%D9%85%D8%B1-%D8%A7%D9%84%D9%85%D8%AE%D8%AA%D8%A7%D8%B1-pdf"
                },
                {
                  name:"طبائع الاستبداد و مصارع الاستعباد",
                  img:"img/h-11.jpg",
                  description:'عاش عبد الرحمن الكواكبي خلال النصف الثاني من القرن التاسع عشر، وهي فترة عانت الأمم العربية فيها الكثير من الضعف والهوان، فهمَّ المستعمِر بها يغتصب أراضيها، ويستنزف مواردها، وقد شخص عبد الرحمن الكواكبي في كتابه «طبائع الاستبداد ومصارع الاستعباد» سبب هذا الداء الذي رآه يتمثل في الاستبداد السياسي، بأنواعه الكثيرة، ومنها استبداد الجهل على العلم، و استبداد النفس على العقل، فهو يقول: إن الله خلق الإنسان حرّا، قائده العقل، فكفر وأبى إلا أن يكون عبدًا قائده الجهل، و يرى إن المستبد فرد عاجز، لا حول له ولا قوة إلا بأعوانه أعداء العدل وأنصار الجور، وأن تراكم الثروات المفرطة، مولِّدٌ للاستبداد، ومضرٌ بأخلاق الأفراد، وأن الاستبداد أصل لكل فساد، فيجد أن الشورى الدستورية هي دواؤه.',
                  url:"https://www.hindawi.org/books/30272530/"},]
                 
                        
                        
                     


function check(){
  

  var type=document.getElementById("bookType").value;
 
//to appear human-developement books
  if(type === "human-developement"){
    if($('#human-developement').hasClass("hide")){
      $('#human-developement').addClass("show");
      $('#human-developement').removeClass("hide");
      if($('#religious').hasClass('show')){
        $('#religious').addClass('hide');
        $('#religious').removeClass('show');
      }
      if($('#historical').hasClass('show')){
        $('#historical').addClass('hide');
        $('#historical').removeClass('show');
      } 
 
    
    }else{
      $('#'+type).removeClass("show");
      $('#'+type).addClass("hide");
    }
    (createElement(humanDevelopement , type));
   

  }

//to appear religious books
  else if(type === "religious"){
    createElement(religious,type);
    if($('#religious').hasClass('hide')){
      $('#religious').addClass('show');
      $('#religious').removeClass('hide');
    
    if($('#human-developement').hasClass("show")){
      $('#human-developement').addClass("hide");
      $('#human-developement').removeClass("show");
    }
      if($('#historical').hasClass('show')){
        $('#historical').addClass('hide');
        $('#historical').removeClass('show');
      } 
  
    
    }else{
      $('#'+type).removeClass("show");
      $('#'+type).addClass("hide");
    }





  }
  //to appear historical books
  else if(type === "historical"){
    if($('#historical').hasClass("hide")){
      $('#historical').addClass("show");
      $('#historical').removeClass("hide");
      if($('#religious').hasClass('show')){
        $('#religious').addClass('hide');
        $('#religious').removeClass('show');
      }
      if($('#human-developement').hasClass('show')){
        $('#human-developement').addClass('hide');
        $('#human-developement').removeClass('show');
      } 

    }else{
      $('#'+type).removeClass("show");
      $('#'+type).addClass("hide");
    }
    (createElement(historical , type));
  
  }
}
  
//function to create Element
function createElement(array , type){
    for(var i = 0 ; i < array.length ; i++){
      obj=array[i];
       $('#'+type).append("<div class='col-md-3 col-sm-4 col-xs-5'><div class='book text-center'> <img class='cover' src="+array[i].img+" alt='pic_1'><div class='text-book'><h4 class='title'>"+array[i].name+"</h4><p class='description'>"+array[i].description+"</p></div><a href="+array[i].url+" target='_blank'><button class='btn btn-success center'>Download</button></a></div></div>");
    }
}
// function htmlEntities(str) {
//   return String(str).replace(/&/g, '&amp;').replace(/</g, '&lt;').replace(/>/g, '&gt;').replace(/"/g, '&quot;');
// }
var newArray=[];
newArray.push(religious);
newArray.push(humanDevelopement);
newArray.push(historical);

// function searchFunc(){
//   var inputField = document.getElementById('searchInput').value;
//   // console.log(inputField)
//   for(var i=0;i<newArray.length;i++){
//     //pass every object in newArray
//   const index1 = newArray[i].findIndex(function(object , index){
//       if(object.name === inputField){
//         $('#h').innerHTML="";
//         $("#h").append("<div class='col-md-3 col-sm-4 col-xs-5'><div class='book text-center'> <img class='cover' src="+object.img+" alt='pic_1'><div class='text-book'><h4 class='title'>"+object.name+"</h4><p class='description'>"+object.description+"</p></div><a href="+object.url+" target='_blank'><button class='btn btn-success center'>Download</button></a></div></div>");
//       }
//     });  
//   } 
// }

function searchFunc(){
  var inputField = document.getElementById('searchInput').value;
  // console.log(inputField)
  for(var i=0;i<newArray.length;i++){
    //pass every object in newArray
  const index1 = newArray[i].findIndex(function(object , index){
      if(object.name === inputField){
        $('#h').innerHTML="";
        $("#h").append("<div class='col-md-3 col-sm-4 col-xs-5'><div class='book text-center'> <img class='cover' src="+object.img+" alt='pic_1'><div class='text-book'><h4 class='title'>"+object.name+"</h4><p class='description'>"+object.description+"</p></div><a href="+object.url+" target='_blank'><button class='btn btn-success center'>Download</button></a></div></div>");
      }
    });  
  } 
}







//sign in function
var user=[{'name':'maysaa' , 'pass':'123'},{'name':'yahya' ,'pass':'456' }] 
function signIn(){
  var nameInput=document.getElementById('name').value;
  var passInput=document.getElementById('pass').value;
  var par=document.getElementById('must');
  
  const checkFind = user.findIndex(function(object,index){
   
    if(object.name.toLowerCase() === nameInput.toLowerCase() && object.pass === passInput){
      window.location.href = "index.html";
    }else{
      
      par.innerHTML='your name or password is not correct';
    }
    
  })


}

































